org/history/dawn-of-a-new-age.org
#+title: Dawn Of A New Age: The Age of Chronos
#+startup: inlineimages

* Dawn Of A New Age: The Age of Chronos
** Before an Age: Time dilation
Quantum mechanics revealed the possibility of creating time dilation fields, where the rate of the passage of time could be manipulated locally. The first applications of this was in food preservation. Before long, household refrigerators came with time dilation. Slowing time within a refrigerator extended the shelf life of fresh fruits, vegetables, and meat. Freezing was no longer necessary. A fresh cut of beef could be preserved unfrozen and fresh one hundred times longer in such a refrigerator than before. Three months of refrigeration, and the food would be just as fresh as one day without dilation.
