html/history/dawn-of-a-new-age.html
---
title: "Dawn Of A New Age: The Age of Chronos"
---
<div id="outline-container-dawn-of-a-new-age-the-age-of-chronos" class="outline-2">
<h2 id="dawn-of-a-new-age-the-age-of-chronos">Dawn Of A New Age: The Age of Chronos</h2>
<div class="outline-text-2" id="text-dawn-of-a-new-age-the-age-of-chronos">
</div>
<div id="outline-container-before-an-age-time-dilation" class="outline-3">
<h3 id="before-an-age-time-dilation">Before an Age: Time dilation</h3>
<div class="outline-text-3" id="text-before-an-age-time-dilation">
<p>
Quantum mechanics revealed the possibility of creating time dilation fields, where the rate of the passage of time could be manipulated locally. The first applications of this was in food preservation. Before long, household refrigerators came with time dilation. Slowing time within a refrigerator extended the shelf life of fresh fruits, vegetables, and meat. Freezing was no longer necessary. A fresh cut of beef could be preserved unfrozen and fresh one hundred times longer in such a refrigerator than before. Three months of refrigeration, and the food would be just as fresh as one day without dilation.
</p>
</div>
</div>
</div>
